# -*- coding: utf-8 -*-
import sys
import codecs
import re

if len(sys.argv)!=3:
    print "Usage: export_registration_info.py [nat_id_list] [output_filename]"
    quit()

from django.conf import settings
from django_bootstrap import bootstrap
bootstrap(__file__)

from confirmation.models import StudentRegistration
from application.models import Applicant, Major, PersonalInfo, Education, Address, SubmissionInfo

import datetime

school_data = {}

SCHOOL_NAME_PATCHES = {
    u'สาธิตมศวปทุมวัน---กรุงเทพมหานคร':u'สาธิตมหาวิทยาลัยศรีนครินทรวิโรฒ ปทุมวัน',
    u'สาธิตมหาวิทยาลัยศรีนครินทร์วิโรฒปทุมวัน---กรุงเทพมหานคร':u'สาธิตมหาวิทยาลัยศรีนครินทรวิโรฒ ปทุมวัน',
    u'สาธิตมศว.ประสานมิตรฝ่ายมัธยม---กรุงเทพมหานคร':u'สาธิตมหาวิทยาลัยศรีนครินทรวิโรฒ ปทุมวัน',
    u'สาธิตมศวประสานมิตรฝ่ายมัธยม---กรุงเทพมหานคร':u'สาธิตมหาวิทยาลัยศรีนครินทรวิโรฒ ปทุมวัน',
    u'สาธิตมศวประสานมิตรมัธยม---กรุงเทพมหานคร':u'สาธิตมหาวิทยาลัยศรีนครินทรวิโรฒ ปทุมวัน',
    u'สาธิตมศวประสานมิตร---กรุงเทพมหานคร':u'สาธิตมหาวิทยาลัยศรีนครินทรวิโรฒ ปทุมวัน',
    u'สาธิตมศว.ปทุมวัน---กรุงเทพมหานคร':u'สาธิตมหาวิทยาลัยศรีนครินทรวิโรฒ ปทุมวัน',
    u'สาธิตมศว.ประสานมิตร---กรุงเทพมหานคร':u'สาธิตมหาวิทยาลัยศรีนครินทรวิโรฒ ปทุมวัน',
    u'สาธิตปทุมวัน---กรุงเทพมหานคร':u'สาธิตมหาวิทยาลัยศรีนครินทรวิโรฒ ปทุมวัน',

    u'สาธิตจุฬาฯ---กรุงเทพมหานคร':u'สาธิตจุฬาลงกรณ์มหาวิทยาลัย (ฝ่ายมัธยม)',
    u'สาธิตจุฬาลงกรณ์มหาวิทยาลัย---กรุงเทพมหานคร':u'สาธิตจุฬาลงกรณ์มหาวิทยาลัย (ฝ่ายมัธยม)',
    u'สาธิตจุฬาลงกรณ์มหาวิทยาลัยมัธยม---กรุงเทพมหานคร':u'สาธิตจุฬาลงกรณ์มหาวิทยาลัย (ฝ่ายมัธยม)',
    u'สาธิตจุฬาฝ่ายมัธยม---กรุงเทพมหานคร':u'สาธิตจุฬาลงกรณ์มหาวิทยาลัย (ฝ่ายมัธยม)',
    u'สาธิตจุฬาฯฝ่ายมัธยม---กรุงเทพมหานคร':u'สาธิตจุฬาลงกรณ์มหาวิทยาลัย (ฝ่ายมัธยม)',
    u'สาธิตจุฬา---กรุงเทพมหานคร':u'สาธิตจุฬาลงกรณ์มหาวิทยาลัย (ฝ่ายมัธยม)',

    u'สาธิตเกษตร---กรุงเทพมหานคร':u'สาธิตแห่งมหาวิทยาลัยเกษตรศาสตร์ ศูนย์วิจัยและพัฒนาการศึกษา',
    u'สาธิตแห่งมหาวิทยาลัยเกษตรศาสตร์---กรุงเทพมหานคร':u'สาธิตแห่งมหาวิทยาลัยเกษตรศาสตร์ ศูนย์วิจัยและพัฒนาการศึกษา',

    u'สาธิตมหาวิทยาลัยขอนแก่นศึกษาศาสตร์---ขอนแก่น':u'สาธิตมหาวิทยาลัยขอนแก่น (ศึกษาศาสตร์) ระดับมัธยม',

    u'สาธิตมหาวิทยาลัยรามคำแหง---กรุงเทพมหานคร':u'สาธิตมหาวิทยาลัยรามคำแหง (ฝ่ายมัธยม)',
    
    u'บดินทรเดชาสิงห์สิงหเสนี๒---กรุงเทพมหานคร':u'บดินทรเดชา (สิงห์ สิงหเสนี) 2',
    u'บดิทรเดชาสิงห์สิงหเสนี๒---กรุงเทพมหานคร':u'บดินทรเดชา (สิงห์ สิงหเสนี) 2',
    u'บดินทรเดชาสิงห์สิงห์เสนี2---กรุงเทพมหานคร':u'บดินทรเดชา (สิงห์ สิงหเสนี) 2',
    u'บดินเดชาสิงห์สิงหเสนี2---กรุงเทพมหานคร':u'บดินทรเดชา (สิงห์ สิงหเสนี) 2',
    u'บดินทรเดชา2---กรุงเทพมหานคร':u'บดินทรเดชา (สิงห์ สิงหเสนี) 2',
    u'บดินทร2---กรุงเทพมหานคร':u'บดินทรเดชา (สิงห์ สิงหเสนี) 2',

    u'มงฟอร์ตวิทยาลัย---เชียงใหม่':u'มงฟอร์ตวิทยาลัย แผนกมัธยม',
    u'มงฟอร์ต---เชียงใหม่':u'มงฟอร์ตวิทยาลัย แผนกมัธยม',

    u'ยุพราชวิทยาลัยเชียงใหม่---เชียงใหม่':u'ยุพราชวิทยาลัย',

    u'สตรีวิทยา2---กรุงเทพมหานคร':u'สตรีวิทยา ๒',
    u'สตรีวิิทยา2---กรุงเทพมหานคร':u'สตรีวิทยา ๒',

    u'กาญจนาภิเษกวิทยาลัยนครปฐม---นครปฐม':u'กาญจนาภิเษกวิทยาลัย นครปฐม (พระตำหนักสวนกุหลาบมัธยม)',
    u'กาญจนาภิเ๋ษกวิทยาลัยนครปฐม---นครปฐม':u'กาญจนาภิเษกวิทยาลัย นครปฐม (พระตำหนักสวนกุหลาบมัธยม)',

    u'มหาวชิราวุธ---สงขลา':u'มหาวชิราวุธ จังหวัดสงขลา',
    u'มหาวิชราวุธ---สงขลา':u'มหาวชิราวุธ จังหวัดสงขลา',

    u'จุฬาภรณราชวิทยาลัย---พิษณุโลก':u'จุฬาภรณราชวิทยาลัย พิษณุโลก',

    u'สวนกุหลาบ---กรุงเทพมหานคร':u'สวนกุหลาบวิทยาลัย',

    u'เตรียมอุดมศึษา---กรุงเทพมหานคร':u'เตรียมอุดมศึกษา',
    u'สารสาสน์วิเทศบาบอน---สมุทรสงคราม':(u'สารสาสน์วิเทศบางบอน',u'กรุงเทพมหานคร'),

    u'ภ.ป.ร.ราชวิทยาลัยฯ---นครปฐม':u'ภ.ป.ร.ราชวิทยาลัย ในพระบรมราชูปถัมภ์',

    u'พรหมานุสรณ์---เพชรบุรี':u'พรหมานุสรณ์จังหวัดเพชรบุรี',

    u'เบญจมราชูทิศ---ราชบุรี':u'เบญจมราชูทิศ ราชบุรี',
    u'เบญจมราชูทิศ---จันทบุรี':u'เบญจมราชูทิศ จังหวัดจันทบุรี',
    u'เบญจมราชูทิศจ.จันทุบรี---จันทบุรี':u'เบญจมราชูทิศ จังหวัดจันทบุรี',
    u'เบญจมราชูทิศจันทบุรี---จันทบุรี':u'เบญจมราชูทิศ จังหวัดจันทบุรี',

    u'ราชวินิตบางแก้ว---สมุทรปราการ':u'ราชวินิตบางแก้ว ในพระบรมราชูปถัมภ์',

    u'สาธิตมหาวิทยาลัยราชภัฎนครปฐม---นครปฐม':u'สาธิตมหาวิทยาลัยราชภัฏนครปฐม',

    u'มัธยมสาธิตมหาวิทยาลัยราชภัฏบ้านสมเด็จเจ้าพระยา---กรุงเทพมหานคร':u'สาธิตมหาวิทยาลัยราชภัฏบ้านสมเด็จเจ้าพระยา',


u'สาธิตพิบูลบำเพ็ญม.บูรพา---ชลบุรี':u'สาธิต "พิบูลบำเพ็ญ" มหาวิทยาลัยบูรพา',
u'จุฬาภรณราชวิทยาลัย---ชลบุรี':u'จุฬาภรณราชวิทยาลัย ชลบุรี',
u'หาดใหญ่วิทายาลัย---สงขลา':u'หาดใหญ่วิทยาลัย',
u'สาธิตมหาวิทยาลัยมหาสารคาม---มหาสารคาม':u'สาธิตมหาวิทยาลัยมหาสารคาม (ฝ่ายมัธยม)',
u'สาธิตสวนสุนันทา---กรุงเทพมหานคร':u'มัธยมสาธิตมหาวิทยาลัยราชภัฏสวนสุนันทา',
u'โรงเีรียนเทพศิรินทร์---กรุงเทพมหานคร':u'เทพศิรินทร์',
u'เบญจมราชูทิศจ.จันทบุรี---จันทบุรี':u'เบญจมราชูทิศ จังหวัดจันทบุรี',
u'นครสวรรคฺ์---นครสวรรค์':u'นครสวรรค์',
u'บางมดวิทยาสีสุกหวาดจวนอุปถัมภ์---กรุงเทพมหานคร':u'บางมดวิทยา',
u'สาธิตแห่งมหาลัยวิทยาลัยเกษตรศาสตร์ศูนย์วิจัยและพัฒนาการศึกษา---กรุงเทพมหานคร':u'สาธิตแห่งมหาวิทยาลัยเกษตรศาสตร์ ศูนย์วิจัยและพัฒนาการศึกษา',
u'สาธิตวัดพระศรีมหาธาตุ---กรุงเทพมหานคร':u'มัธยมสาธิตวัดพระศรีมหาธาตุ มหาวิทยาลัยราชภัฏพระนคร',
u'สตรีวัดมหาพฤฒารามในพระบรมราชินูปถัมป์---กรุงเทพมหานคร':u'สตรีวัดมหาพฤฒาราม ในพระบรมราชินูปถัมภ์',
u'สวนกุหลาบวิทยาลับฯ---กรุงเทพมหานคร':u'สวนกุหลาบวิทยาลัย',
u'สาธิตแห่งมหาวิทยาลัยเกษตรศาสตร์โครงการการศึกษาพหุภาษาศูนย์วิจัยและพัฒนาการศึกษา---ชลบุรี':u'สาธิตมหาวิทยาลัยเกษตรศาสตร์ โครงการการศึกษาพหุภาษา ศูนย์วิจัยและพัฒนาการศึกษา',
u'สาธิตพิบูลบำเพ็ญ---ชลบุรี':u'สาธิต "พิบูลบำเพ็ญ" มหาวิทยาลัยบูรพา',
u'สาธิตพิบูลบำเพ็ญ---ชลบุรี':u'สาธิต "พิบูลบำเพ็ญ" มหาวิทยาลัยบูรพา',
u'สาธิต\'พิบูลบำเพ็ญ\'มหาวิทยาลัยบูรพา---ชลบุรี':u'สาธิต "พิบูลบำเพ็ญ" มหาวิทยาลัยบูรพา',
u'สาธิตมศวฝ่ายมัธยม---กรุงเทพมหานคร':u'สาธิตมหาวิทยาลัยศรีนครินทรวิโรฒ ประสานมิตร (ฝ่ายมัธยม)',
u'มัธยมสาธิตวัดพระศรีมหาธาตุมหาวิยาลัยราชภัฏพระนคร---กรุงเทพมหานคร':u'มัธยมสาธิตวัดพระศรีมหาธาตุ มหาวิทยาลัยราชภัฏพระนคร',
u'สวนกุหลาบนนทบุรี---นนทบุรี':u'สวนกุหลาบวิทยาลัย นนทบุรี',
u'ทวีธาภิเศก2---กรุงเทพมหานคร':u'ทวีธาภิเศก ๒',
u'สตรีวัดมหาพฤฒาราม---กรุงเทพมหานคร':u'สตรีวัดมหาพฤฒาราม ในพระบรมราชินูปถัมภ์',
u'จุ๋งฮัวโซะเซียว---ตรัง':u'จุ๋งฮัวโชะเซียว',
u'สาธิตราชภัฏพระนครศรีอยุธยา---พระนครศรีอยุธยา':u'สาธิตมหาวิทยาลัยราชภัฏพระนครศรีอยุธยา',
u'เฉลิมพระเกียรติสมเด็จพระศรีนครินทร์---กาญจนบุรี':u'เฉลิมพระเกียรติสมเด็จพระศรีนครินทร์ กาญจนบุรี',
u'สาธตมศวประสานมิตรฝ่ายมัธยม---กรุงเทพมหานคร':u'สาธิตมหาวิทยาลัยศรีนครินทรวิโรฒ ประสานมิตร (ฝ่ายมัธยม)',
u'SaintGabriel---กรุงเทพมหานคร':u'เซนต์คาเบรียล',
u'อุดรพิทยานุกลู---อุดรธานี':u'อุดรพิทยานุกูล',
u'สตรีศีสุริโยทัย---กรุงเทพมหานคร':u'สตรีศรีสุริโยทัย',
u'เ้บญจมราชูทิศราชบุรี---ราชบุรี':u'เบญจมราชูทิศ ราชบุรี',
u'สายน้ำผึ้ง---กรุงเทพมหานคร':u'สายน้ำผึ้ง ในพระอุปถัมภ์ฯ',
u'วัดสุทธิวรามราม---กรุงเทพมหานคร':u'วัดสุทธิวราราม',
u'สตรีมหาพฤฒารามในพระบรมราชินูปถัมภ์---กรุงเทพมหานคร':u'สตรีวัดมหาพฤฒาราม ในพระบรมราชินูปถัมภ์',
u'สาธิตมหาวิทยาลัยราชภัฏสวนสุนันทา---กรุงเทพมหานคร':u'มัธยมสาธิตมหาวิทยาลัยราชภัฏสวนสุนันทา',
u'ชลราษฏรอำรุง---ชลบุรี':u'ชลราษฎรอำรุง',
u'สาธิตมหาวิทยาลัยราชภัฎพระนครศรีอยุธยา---พระนครศรีอยุธยา':u'สาธิตมหาวิทยาลัยราชภัฏพระนครศรีอยุธยา',
u'นวมินทราชินูทิศสตรีวิทยา๒---กรุงเทพมหานคร':u'นวมินทราชินูทิศ สตรีวิทยา 2',
u'เบญจมราชาลัยในพระบรมราชูประถัมภ์---กรุงเทพมหานคร':u'เบญจมราชาลัย ในพระบรมราชูปถัมภ์',
u'วรนารีเฉลิม---สงขลา':u'วรนารีเฉลิม จังหวัดสงขลา',
u'สาธิตมหาวิทยาลัยราชภัฏสวนสุนันทา---กรุงเทพมหานคร':u'มัธยมสาธิตมหาวิทยาลัยราชภัฏสวนสุนันทา',
u'สุขุมนวพันธ์อุปถัมภ์---กรุงเทพมหานคร':u'บางกะปิสุขุมนวพันธ์อุปถัมภ์',
u'วิทยาลัยอาชีวศึกษาเทคโนโลยีฐานวิทยาศาสตร์ชลบุรี---ชลบุรี':u'วิทยาลัยอาชีวศึกษาเทคโนโลยีฐานวิทยาศาสตร์ [วิทยาลัยการอาชีพพานทอง]',
u'สาธิตราชภัฎนครปฐม---นครปฐม':u'สาธิตมหาวิทยาลัยราชภัฏนครปฐม',
u'กาฬสิธุ์พิทยาสรรพ์---กาฬสินธุ์':u'กาฬสินธุ์พิทยาสรรพ์',
u'นวมิทรชินูทิศหอวังนนทบุรี---นนทบุรี':u'นวมินทราชินูทิศ หอวัง นนทบุรี',
u'หอวัง---ปทุมธานี':u'หอวัง  ปทุมธานี',
u'สามเสนวิืทยาลัย---กรุงเทพมหานคร':u'สามเสนวิทยาลัย',
u'ดรุณสิกขาลัยมหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรีโครงการวมว.---กรุงเทพมหานคร':u'ดรุณสิกขาลัย มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี',
u'วิทยาลัย้ทคโนโลยีอุตสาหกรรมมหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือ---กรุงเทพมหานคร':u'วิทยาลัยเทคโนโลยีอุตสาหกรรม มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือ',
u'รัตนราษฏร์บำรุง---ราชบุรี':u'รัตนราษฎร์บำรุง',
u'สภาราชินี---ตรัง':u'สภาราชินี จังหวัดตรัง',
u'สาธิตพระนครศรีอยุธยา---พระนครศรีอยุธยา':u'สาธิตมหาวิทยาลัยราชภัฏพระนครศรีอยุธยา',
u'สาธิตพิบูลบำเพ็ญ---ชลบุรี':u'สาธิต "พิบูลบำเพ็ญ" มหาวิทยาลัยบูรพา',
u'วินิตศึกษา---ลพบุรี':u'วินิตศึกษา ในพระราชูปถัมภ์ฯ',
u'มัธยมฯสาธิตวัดพระศรีมหาธาตุมหาวิทยาลัยราชภัฏพระนคร---กรุงเทพมหานคร':u'มัธยมสาธิตวัดพระศรีมหาธาตุ มหาวิทยาลัยราชภัฏพระนคร',
u'เซนต์หลุยส์---ฉะเชิงเทรา':u'เซนต์หลุยส์ ฉะเชิงเทรา',
u'อุดมศึกษา---กรุงเทพมหานคร':u'อุดมศึกษา',
u'สามเสนวิทยาลีย---กรุงเทพมหานคร':u'สามเสนวิทยาลัย',
u'กรุงเทพคริาเตียนวิทยาลัย---กรุงเทพมหานคร':u'กรุงเทพคริสเตียนวิทยาลัย',
u'วินิตศึกษา---ลพบุรี':u'วินิตศึกษา ในพระราชูปถัมภ์ฯ',
u'นวมินทราชินูทิศสวนกุหลาบวิทยาลัยสมุรปราการ---สมุทรปราการ':u'นวมินทราชินูทิศ สวนกุหลาบวิทยาลัย สมุทรปราการ',
u'เตรียมอุดมศึกษาน้อมเ้า---กรุงเทพมหานคร':u'เตรียมอุดมศึกษาน้อมเกล้า',
u'บุญวาทย์---ลำปาง':u'บุญวาทย์วิทยาลัย',
u'สวนกุหลาบวิทยาลัย---นนทบุรี':u'สวนกุหลาบวิทยาลัย นนทบุรี',
u'เซนต์หลุยส์---ฉะเชิงเทรา':u'เซนต์หลุยส์ ฉะเชิงเทรา',
u'สภาราชินี---ตรัง':u'สภาราชินี จังหวัดตรัง',
u'สาธิตมหาวิทยาลัยราชภัฎเทพสตรี---ลพบุรี':u'สาธิตมหาวิทยาลัยราชภัฏเทพสตรี',
u'บุรีัรัมย์พิทยาคม---บุรีรัมย์':u'บุรีรัมย์พิทยาคม',
u'อัสสัมขัญธนุบรี---กรุงเทพมหานคร':u'อัสสัมชัญธนบุรี',
u'ราชสีมาวิทยาลัย๒---นครราชสีมา':u'ราชสีมาวิทยาลัย 2',
u'วรนารีเฉลิม---สงขลา':u'วรนารีเฉลิม จังหวัดสงขลา',
u'คณะราษฎรบำรงจังหวัดยะลา---ยะลา':u'คณะราษฎรบำรุง จังหวัดยะลา',
u'สมุทรสารครวิทยาลัย---สมุทรสาคร':u'สมุทรสาครวิทยาลัย',
u'สาธิตเกษตรพหุภาษา---ชลบุรี':u'สาธิตมหาวิทยาลัยเกษตรศาสตร์ โครงการการศึกษาพหุภาษา ศูนย์วิจัยและพัฒนาการศึกษา',
u'สาธิตมหาวิทยาลัยราชภัฏสวนสุนันทา---กรุงเทพมหานคร':u'มัธยมสาธิตมหาวิทยาลัยราชภัฏสวนสุนันทา',
u'วิทยาลัยเทคโนโลยีอุตสาหกรรม---กรุงเทพมหานคร':u'วิทยาลัยเทคโนโลยีอุตสาหกรรม มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือ',

'ทวีธาภิเศก---นนทบุรี':(u'ทวีธาภิเศก',u'กรุงเทพมหานคร'),
u'ยอแซฟอุปถัมภ์---กรุงเทพมหานคร':(u'ยอแซฟอุปถัมภ์',u'นครปฐม'),
u'มหิดลวิทยานุสรณ์---กรุงเทพมหานคร':(u'มหิดลวิทยานุสรณ์',u'นครปฐม'),
u'สาธิตเกษตร---นนทบุรี':(u'สาธิตแห่งมหาวิทยาลัยเกษตรศาสตร์ ศูนย์วิจัยและพัฒนาการศึกษา',u'กรุงเทพมหานคร'),
u'เซนต์คาเบรียล---นนทบุรี':(u'เซนต์คาเบรียล',u'กรุงเทพมหานคร'),
u'สตรีนนทบุรี---ปทุมธานี':(u'สตรีนนทบุรี',u'นนทบุรี'),
u'มหิดลวิทยานุสรณ์---ขอนแก่น':(u'มหิดลวิทยานุสรณ์',u'นครปฐม'),
u'เบญจมราชรังสฤษฏิ์---ฉะเชิงเทรา':(u'เบญจมราชรังสฤษฎิ์',u'ฉะเชิงเทรา'),
u'เตรียมทหาร---กรุงเทพมหานคร':(u'เตรียมทหาร',u'นครนายก'),

}

def normalize_school_name(school_name, school_province):
    if school_name.startswith(u'โรงเรียน'):
        school_name = school_name[8:]
    nname = re.sub(r'[ ()"]','',school_name)
    return u"%s---%s" % (nname,school_province)

def read_school_data(data_filename):
    f = codecs.open(data_filename,'r',encoding='utf-8')
    for l in f.readlines():
        items = l.strip().split(',')
        if len(items)==3:
            school_data[normalize_school_name(items[1],items[2])]=items[0]

failed_counter = 0

def find_school_code(school_name, school_province):
    global failed_counter
    nn = normalize_school_name(school_name, school_province)
    if nn in SCHOOL_NAME_PATCHES:
        p = SCHOOL_NAME_PATCHES[nn]
        if type(p)==tuple:
            nn = normalize_school_name(p[0],
                                       p[1])
        else:
            nn = normalize_school_name(p,
                                       school_province)
    if nn in school_data:
        return school_data[nn]
    else:
        print nn
        failed_counter += 1
        return ""

MAJOR_CODE = {
    1:'E35',
    2:'E13',
    3:'E09',
    4:'E05',
    5:'E11',
    6:'E06',
    7:'E21',
    8:'E16',
    9:'E14',
    101:'E35',
    102:'E10',
    103:'E05',
    104:'E11',
    105:'E16',
    106:'E18',
    201:'E03',
    202:'E17',
    203:'E11',
}

def build_row(applicant, registration, personal_info, major_number):
    if registration==None:
        registration = StudentRegistration()

    if applicant.title==u'นาย':
        gender = 'M'
        eng_title = 'Mr.'
    else:
        gender = 'F'
        eng_title = 'Miss'

    bd_year = personal_info.birth_date.year + 543
    birth_date_str = personal_info.birth_date.strftime("%d/%m") + "/" + str(bd_year)
    try:
        address = applicant.address.home_address
    except:
        address = Address()

    try:
        education = applicant.education
    except:
        education = Education()

    major_number_str = '0'*(3-len(str(major_number))) + str(major_number)
    try:
        major = Major.objects.get(number=major_number_str)
    except:
        major = Major.objects.get(number='001')

    if major_number<100:
        status = u'ปกติ'
    elif major_number<200:
        status = u'พิเศษ'
    else:
        status = u'นานาชาติ'

    try:
        submission_info = applicant.submission_info
    except:
        applicant.submission_info = SubmissionInfo()
        applicant.submission_info.submitted_at = datetime.datetime.now()

    vnum = ''
    if address.village_number!=0 and address.village_number!=None:
        vnum = address.village_number

    ticket_number = ''
    try:
        ticket_number = unicode(applicant.ticket_number())
    except:
        pass

    return u','.join([u'"%s"' % s for s in
                      [ ticket_number,
                        applicant.national_id,
                        registration.passport_number,
                        gender,
                        applicant.title,
                        applicant.first_name,
                        applicant.last_name,
                        eng_title,
                        registration.english_first_name,
                        registration.english_last_name.capitalize(),
                        personal_info.nationality,
                        personal_info.ethnicity,
                        registration.religion,
                        registration.birth_place,
                        birth_date_str,
                        address.number,
                        vnum,
                        registration.address_avenue,
                        address.road,
                        address.district,
                        address.city,
                        address.province,
                        address.postal_code,
                        registration.home_phone_number,
                        registration.cell_phone_number,
                        applicant.email,
                        find_school_code(education.school_name,
                                         education.school_province),
                        education.school_name,
                        education.school_province,
                        registration.school_type,
                        u'%1.2f' % (registration.GPA),
                        u'บางเขน',
                        'E',
                        u'วิศวกรรมศาสตร์',
                        MAJOR_CODE[int(major.number)],
                        major.name,
                        u'รับตรง คณะวิศวกรรมศาสตร์',
                        status,
                        unicode(applicant.submission_info.submitted_at.strftime('%d/%m/2555')),
                        unicode(applicant.submission_info.submitted_at.strftime('%H/%M/%S')),
                        u'0002',
                        u'เกษตรศาสตร์',
                        applicant.clearing_house_result.password,
                        registration.father_title,
                        registration.father_first_name,
                        registration.father_last_name,
                        registration.father_national_id,
                        registration.mother_title,
                        registration.mother_first_name,
                        registration.mother_last_name,
                        registration.mother_national_id,
                        ]
                      ])

def main():
    read_school_data('../data/school-codes.csv')
    filename = sys.argv[1]
    fout = codecs.open(sys.argv[2],"w",encoding="utf-8")
    for line in open(filename).readlines():
        items = line.strip().split(",")
        if len(items)!=3:
            continue

        national_id = items[0]
        major_number = int(items[1])

        applicant = Applicant.objects.get(national_id=national_id)
        try:
            personal_info = applicant.personal_info
        except:
            personal_info = PersonalInfo(applicant=applicant)
            personal_info.birth_date = datetime.date.today()

        try:
            registration = applicant.student_registration
        except:
            registration = None

        print >> fout, build_row(applicant, registration, personal_info, major_number)

    print failed_counter

if __name__ == '__main__':
    main()

